---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
source: html/168146a2-81a8-207f-0840-eda656e9da0f.htm
---
# StructuralConnectionApprovalType Properties

The id of the assembly instance to which the element belongs.